; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l31_p31_c31_g31_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(person-at person1 loc8)
	(person-at person2 loc12)
	(person-at person3 loc9)
	(person-at person4 loc24)
	(person-at person5 loc10)
	(person-at person6 loc26)
	(person-at person7 loc20)
	(person-at person8 loc2)
	(person-at person9 loc24)
	(person-at person10 loc13)
	(person-at person11 loc14)
	(person-at person12 loc24)
	(person-at person13 loc4)
	(person-at person14 loc23)
	(person-at person15 loc8)
	(person-at person16 loc11)
	(person-at person17 loc8)
	(person-at person18 loc29)
	(person-at person19 loc27)
	(person-at person20 loc8)
	(person-at person21 loc7)
	(person-at person22 loc4)
	(person-at person23 loc27)
	(person-at person24 loc20)
	(person-at person25 loc7)
	(person-at person26 loc8)
	(person-at person27 loc7)
	(person-at person28 loc29)
	(person-at person29 loc3)
	(person-at person30 loc21)
	(person-at person31 loc29)
	(person-need person1 food)
	(person-need person3 food)
	(person-need person4 food)
	(person-need person4 medicine)
	(person-need person5 food)
	(person-need person6 medicine)
	(person-need person7 food)
	(person-need person10 food)
	(person-need person11 food)
	(person-need person11 medicine)
	(person-need person13 food)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person17 food)
	(person-need person17 medicine)
	(person-need person18 food)
	(person-need person19 food)
	(person-need person20 food)
	(person-need person20 medicine)
	(person-need person21 food)
	(person-need person21 medicine)
	(person-need person22 food)
	(person-need person22 medicine)
	(person-need person23 food)
	(person-need person23 medicine)
	(person-need person24 food)
	(person-need person25 food)
	(person-need person27 food)
	(person-need person28 food)
	(person-need person29 food)
	(person-need person31 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person17 food)
	(has-content-person person17 medicine)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person21 food)
	(has-content-person person21 medicine)
	(has-content-person person22 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 food)
	(has-content-person person25 food)
	(has-content-person person27 food)
	(has-content-person person28 food)
	(has-content-person person29 food)
	(has-content-person person31 food)
))
)

; plan
1. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate31 depot)
   added: (has-crate-drone-arm right crate31)
   goals met: 1 of 32
2. (pick-up-crate crate23 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate23 depot)
   added: (has-crate-drone-arm left crate23)
   goals met: 1 of 32
3. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 0 of 32
4. (drop-crate loc26 person6 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm right crate31)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 1 of 32
5. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 2 of 32
6. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate30 depot)
   added: (has-crate-drone-arm right crate30)
   goals met: 2 of 32
7. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 1 of 32
8. (drop-crate loc23 person14 crate23 left food drone1)
   deleted: (has-crate-drone-arm left crate23)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 2 of 32
9. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 3 of 32
10. (pick-up-crate crate22 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate22 depot)
   added: (has-crate-drone-arm left crate22)
   goals met: 3 of 32
11. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 2 of 32
12. (drop-crate loc13 person10 crate22 left food drone1)
   deleted: (has-crate-drone-arm left crate22)
   added: (has-content-person person10 food) (empty-arm left)
   goals met: 3 of 32
13. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 4 of 32
14. (pick-up-crate crate21 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate21 depot)
   added: (has-crate-drone-arm left crate21)
   goals met: 4 of 32
15. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 3 of 32
16. (drop-crate loc10 person5 crate21 left food drone1)
   deleted: (has-crate-drone-arm left crate21)
   added: (has-content-person person5 food) (empty-arm left)
   goals met: 4 of 32
17. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 5 of 32
18. (pick-up-crate crate20 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate20 depot)
   added: (has-crate-drone-arm left crate20)
   goals met: 5 of 32
19. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 4 of 32
20. (drop-crate loc9 person3 crate20 left food drone1)
   deleted: (has-crate-drone-arm left crate20)
   added: (has-content-person person3 food) (empty-arm left)
   goals met: 5 of 32
21. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 6 of 32
22. (pick-up-crate crate19 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate19 depot)
   added: (has-crate-drone-arm left crate19)
   goals met: 6 of 32
23. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 5 of 32
24. (drop-crate loc3 person29 crate19 left food drone1)
   deleted: (has-crate-drone-arm left crate19)
   added: (has-content-person person29 food) (empty-arm left)
   goals met: 6 of 32
25. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 7 of 32
26. (pick-up-crate crate18 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate18 depot)
   added: (has-crate-drone-arm left crate18)
   goals met: 7 of 32
27. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 6 of 32
28. (drop-crate loc29 person18 crate18 left food drone1)
   deleted: (has-crate-drone-arm left crate18)
   added: (has-content-person person18 food) (empty-arm left)
   goals met: 7 of 32
29. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 8 of 32
30. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate17 depot)
   added: (has-crate-drone-arm left crate17)
   goals met: 8 of 32
31. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 7 of 32
32. (drop-crate loc29 person28 crate17 left food drone1)
   deleted: (has-crate-drone-arm left crate17)
   added: (has-content-person person28 food) (empty-arm left)
   goals met: 8 of 32
33. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 9 of 32
34. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate16 depot)
   added: (has-crate-drone-arm left crate16)
   goals met: 9 of 32
35. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 8 of 32
36. (drop-crate loc29 person31 crate16 left food drone1)
   deleted: (has-crate-drone-arm left crate16)
   added: (has-content-person person31 food) (empty-arm left)
   goals met: 9 of 32
37. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 10 of 32
38. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate15 depot)
   added: (has-crate-drone-arm left crate15)
   goals met: 10 of 32
39. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 9 of 32
40. (drop-crate loc27 person19 crate15 left food drone1)
   deleted: (has-crate-drone-arm left crate15)
   added: (has-content-person person19 food) (empty-arm left)
   goals met: 10 of 32
41. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 11 of 32
42. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate14 depot)
   added: (has-crate-drone-arm left crate14)
   goals met: 11 of 32
43. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 10 of 32
44. (drop-crate loc27 person23 crate14 left food drone1)
   deleted: (has-crate-drone-arm left crate14)
   added: (has-content-person person23 food) (empty-arm left)
   goals met: 11 of 32
45. (drop-crate loc27 person23 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm right crate30)
   added: (has-content-person person23 medicine) (empty-arm right)
   goals met: 12 of 32
46. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 13 of 32
47. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate29 depot)
   added: (has-crate-drone-arm right crate29)
   goals met: 13 of 32
48. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 13 of 32
49. (drone-move depot loc24 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc24)
   goals met: 12 of 32
50. (drop-crate loc24 person4 crate13 left food drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person4 food) (empty-arm left)
   goals met: 13 of 32
51. (drop-crate loc24 person4 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm right crate29)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 14 of 32
52. (drone-move loc24 depot drone1)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 depot)
   goals met: 15 of 32
53. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate28 depot)
   added: (has-crate-drone-arm right crate28)
   goals met: 15 of 32
54. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 15 of 32
55. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 14 of 32
56. (drop-crate loc20 person7 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 15 of 32
57. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 16 of 32
58. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 16 of 32
59. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 15 of 32
60. (drop-crate loc20 person24 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person24 food) (empty-arm left)
   goals met: 16 of 32
61. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 17 of 32
62. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 17 of 32
63. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 16 of 32
64. (drop-crate loc14 person11 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 17 of 32
65. (drop-crate loc14 person11 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm right crate28)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 18 of 32
66. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 19 of 32
67. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate27 depot)
   added: (has-crate-drone-arm right crate27)
   goals met: 19 of 32
68. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 19 of 32
69. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 18 of 32
70. (drop-crate loc8 person1 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 19 of 32
71. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 20 of 32
72. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 20 of 32
73. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 19 of 32
74. (drop-crate loc8 person15 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person15 food) (empty-arm left)
   goals met: 20 of 32
75. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 21 of 32
76. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 21 of 32
77. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 20 of 32
78. (drop-crate loc8 person17 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person17 food) (empty-arm left)
   goals met: 21 of 32
79. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 22 of 32
80. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 22 of 32
81. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 21 of 32
82. (drop-crate loc8 person17 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm right crate27)
   added: (has-content-person person17 medicine) (empty-arm right)
   goals met: 22 of 32
83. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 23 of 32
84. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate26 depot)
   added: (has-crate-drone-arm right crate26)
   goals met: 23 of 32
85. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 22 of 32
86. (drop-crate loc8 person20 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person20 food) (empty-arm left)
   goals met: 23 of 32
87. (drop-crate loc8 person20 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm right crate26)
   added: (has-content-person person20 medicine) (empty-arm right)
   goals met: 24 of 32
88. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 25 of 32
89. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 25 of 32
90. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 25 of 32
91. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 24 of 32
92. (drop-crate loc7 person21 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person21 food) (empty-arm left)
   goals met: 25 of 32
93. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 26 of 32
94. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 26 of 32
95. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 25 of 32
96. (drop-crate loc7 person21 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person21 medicine) (empty-arm right)
   goals met: 26 of 32
97. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 27 of 32
98. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate24 depot)
   added: (has-crate-drone-arm right crate24)
   goals met: 27 of 32
99. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 26 of 32
100. (drop-crate loc4 person22 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm right crate24)
   added: (has-content-person person22 medicine) (empty-arm right)
   goals met: 27 of 32
101. (drop-crate loc4 person13 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 28 of 32
102. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 29 of 32
103. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate3 depot)
   added: (has-crate-drone-arm right crate3)
   goals met: 29 of 32
104. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 28 of 32
105. (drop-crate loc4 person22 crate3 right food drone1)
   deleted: (has-crate-drone-arm right crate3)
   added: (has-content-person person22 food) (empty-arm right)
   goals met: 29 of 32
106. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 30 of 32
107. (pick-up-crate crate2 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate2 depot)
   added: (has-crate-drone-arm right crate2)
   goals met: 30 of 32
108. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 30 of 32
109. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 29 of 32
110. (drop-crate loc7 person25 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person25 food) (empty-arm left)
   goals met: 30 of 32
111. (drop-crate loc7 person27 crate2 right food drone1)
   deleted: (has-crate-drone-arm right crate2)
   added: (has-content-person person27 food) (empty-arm right)
   goals met: 31 of 32
112. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 32 of 32
